{
    "language": "en",
    "home_welcome": "Hi there",
    "home_i": "I'm",
    "home_what_i_do": "I make awesome websites",
    "home_job": "Senior Full Stack Developer, Full Stack Web Developer, Frontend Developer, Backend Developer, Software Engineer",
    "home_location": "Based in Bangkok, Thailand.",
    "home_contact_btn": "Get in touch",
    "menu_about": "About",
    "menu_projects": "Projects",
    "menu_skills": "Skills",
    "menu_experience": "Experience",
    "menu_contact": "Contact",
    "about_desc": "I am a professional developer with a Bachelor's degree in Computer Science. I am currently working as a Senior Full Stack Developer at JMS-United Co.Ltd, Japan. With over 4 years of proven work experience in web development and full-stack expertise, I am consistently eager and passionate about learning new technologies. My goal is to create high-performance, attractive, and user-friendly single-page web applications. And I am also a quick learner. My expertise includes proficiency in a range of programming languages and databases such as HTML, CSS, SCSS, JavaScript, Typescript, Angular, React, Ionic, Python (Flask, Django), Node.js, NoSQL, MySQL, MongoDB, and more. I am a detail-oriented developer with a keen eye for design and a commitment to delivering high-quality work that meets or exceeds client expectations.",
    "experience_0_job": "Senior Full Stack Developer",
    "experience_0_title": "Tasks/Achievements",
    "experience_1_job": "Senior Developer",
    "experience_1_title": "Tasks/Achievements",
    "experience_2_job": "Junior Developer",
    "experience_2_title": "Tasks/Achievements",
    "experience_0_duration": "Jun 2023 - Present (Remote)",
    "experience_1_duration": "Apr 2022 - Jun 2023",
    "experience_2_duration": "August 2019 - Apr 2022",
    "projects_1_overview": "CRM is designed to enhance customer engagement, and optimize business operations.",
    "projects_2_overview": "Status Checker(Telecaster) is a famous natural disaster guideline website in Japan.",
    "projects_3_overview": "Odoo 12 is a suite of open source business apps that cover all your company needs: HRMS, accounting, etc.",
    "projects_4_overview": "Online Auction System is a sytem to bid item from online.",
    "projects_5_overview": "Hoikuen is a system for child nusery to learn and develop from online.",
    "projects_6_overview": "SKC is a system for construction management.",
    "projects_1_extended_overview": "CRM System is a robust and efficient solution for managing customer relationships,built with cutting-edge technologies for a seamless user experience. This comprehensive CRM system leverages the power of ReactJS, Material-UI (MUI), NodeJS, ExpressJS, and MongoDB Atlas to provide a feature-rich and scalable platform. This system includes admin management, user management, sales management, activity management, speech to text management, summarize user speech management with ChatGPT etc. User can also check their reports with multiple type of charts.",
    "projects_2_extended_overview": "In Japan, due to the natural disasters such as earthquakes, floods and typhoons that can occur from time to time, it is very difficult to collect the condition reports of a large number of employees individually. Because of this need, the Telecaster Project was introduced.  It includes Admin management, User management, Question category Sample management, Automatic start matter list etc. When the manager creates a survey form in the event of a natural disaster, a link will be mailed to your team members for response. Through this link, users can easily respond to the status report and the manager can receive the situation of the entire team in real time. The languages used for this project are Angular for FrontEnd, Python for BackEnd, and Google Cloud Storage for Database.",
    "projects_3_extended_overview": "Overall, an Odoo 12 project involves a range of activities, from scoping the project to providing ongoing support. As a project manager, your role will be to oversee these activities and ensure that the project is completed on time, within budget, and to the satisfaction of all stakeholders.It is developed with HTML, CSS, XML and JavaScript and Python.",
    "projects_4_extended_overview": "Online Auction System is a system to bid items from online.People can bid items when items are published. If the deposit is less than bid , they can't successfully bid.People can bid in every 5s until the item bid time expires. This system is developed with ReactJs, Antd, Nodejs, Expressjs, Swagger, Mysql.",
    "projects_5_extended_overview": "Hoikuen Project is a system for child nursery.This project involves designing and setting up a safe and stimulating environment for infants and young children to play, learn and develop. This system is developed with Angular, Strapi, PostgreSQL.",
    "projects_6_extended_overview": "SKC is a software application that helps manage various aspects of construction projects, such as scheduling, budgeting, resource allocation, documentation, and communication. It was developed with Angular, Strapi and PostgreSQL.",
    "contact_full_name": "Full name",
    "contact_email": "E-mail adress",
    "contact_btn": "Send message"
}